Revit 2027 API
RebarSplice.ConnectedRebarId Property
 Identifies the connected rebar id of this rebar splice object.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public ElementId ConnectedRebarId { get; }
Public ReadOnly Property ConnectedRebarId As ElementId
	Get
public:
property ElementId^ ConnectedRebarId {
	ElementId^ get ();
}
member ConnectedRebarId : ElementId with get
Property Value
ElementId
See Also
Reference
RebarSplice Class
Autodesk.Revit.DB.Structure Namespace